// 递推，当前情况数 == 上一步情况数 累加
#include <iostream>
using namespace std;
int dp[1008];			// dp[i] --> 最大数为i时，能产生多少情况           3 --> 2: 3、1 3   正着算

int main() {
	int n;
	cin >> n;
	
	// 计算
	for (int i = 1; i <= n; ++i) {
		dp[i] = 1;		// 只含最高值的单项数列情况
		for (int j = 1; j <= i / 2; ++j) {
			dp[i] += dp[j];
		}
	}
	cout << dp[n] << endl;

	return 0;
}


/*	
f[1] = 1                                → 1

f[2] = 1 + f[1] = 1 + 1 = 2             → 2, 12

f[3] = 1 + f[1] = 1 + 1 = 2             → 3, 13

f[4] = 1 + f[1] + f[2]
     = 1 + 1 + 2 = 4                    → 4, 14, 24, 124

f[5] = 1 + f[1] + f[2]
     = 1 + 1 + 2 = 4                    → 5, 15, 25, 125

f[6] = 1 + f[1] + f[2] + f[3]
     = 1 + 1 + 2 + 2 = 6                → 6, 16, 26, 126, 36, 136
*/